################################################################### #.
#' CLASS : 채권 분석 및 평가
#'
#'  funs : 1. 발행정보 수정 및 적재
#'         2. 투자채권 업데이트 관리
#'
#' 참 고 : 1. KRX    : browseURL('http://data.krx.co.kr')
#'         2. 나이스 : browseURL('https://www.nicerating.com')
#'         3. 한신평 : browseURL('https://www.kisrating.com')
#'         4. 한기평 : browseURL('https://www.korearatings.com')
#'         5. 장단기 : browseURL('https://fred.stlouisfed.org/series/T10Y2Y')
#'            금리차 : browseURL('https://fred.stlouisfed.org/series/T10Y3M')
#'
#' + Fear: webFearGreed()
#' + Path: dirname(rstudioapi::getSourceEditorContext()$path)
#' + KRX 20분 지연 데이터
#'
################################################################### #.


############################'
## `0.작업환경`
############################.
if (!exists('home')) home = dirname(rstudioapi::getSourceEditorContext()$path)
work_path = workPathBond(home)


############################'
## `채권/신용조회`
############################.
# seekBond('유니슨')
# webCreditReport('이원다이애그노믹스')
# webCreditReport('유니슨')


############################'
## `신용등급 업그레이드`
############################.
# updateCredit()


############################'
##' 보유채권조회
##'  - Cash is King
############################.
(mybond <- getBinvest())
mybond$매입금액 %>% sum()
mybond$보유수량 %>% sum()


############################'
## `국채수익률PLOT`  ->> 네이버로 변경(실시간)
############################.
krxTresuryBondYield()


############################'
## `매매현황(실시간)`
############################.
getTarget() %>% arrange(desc(거래량)) %>% head(20)


############################'
## `수익률비교(실시간)`
############################.
dat = compareTable(sect='회사채', minrt = 0.00, maxrt = 0.5)

dat %>%
    filter(잔존년수 >= 0.10) %>%
    filter(연수익률 >= 0.05) %>%
    # filter(CLASS %in% c('A','B')) %>%
    mutate(채권명 = str_sub(채권명, 1, 10)) %>%
    select(-c(채권CD, 표면금리, 잔존기간)) %>%
    # filter(str_detect(종목명, '한국토지'))
    head(20)

comparePlot(tab=dat)


############################'
## `단기채권 수익률 조회`
############################.
dat %>%
  filter(잔존년수 < 1.0) %>%
  filter(CLASS=='aaa' | 거래량 >= 1000) %>%
  filter(CLASS=='aaa' | 월수익률 > 0.01) %>%
  mutate(채권명 = str_sub(채권명, 1, 10)) %>%
  arrange(desc(월수익률)) %>%
  select(-c(채권CD, 표면금리, 잔존년수))



############################'
## 국고(19-6)
#'  - 퇴직연금계좌(나무증권) 2억 보유
#'  - 수익률 3% 수준에서 매도(7,800원)
############################.
krcd = 'KR103502G990'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가 = 7500)



############################'
#' `유니슨15 (KR6018001D68)`
#'   - 신용등급 BB- (부도확률 20%)
#'     기대수익 = (10000*0.30*0.80 - 10000*1.00*0.20)
#'   - 23년 5월 BB-로 하락
#'   - 밍양과 합작법인 설립 >> 사천공장 부지내 해상풍력터빈 생산공장 건설
#'   - 해상풍력발전 육성 정책 --> 24년 수주 상황 확인 필요
#'   - 유니슨15WR 행사 가능 (리픽싱: 1,119원)
#'
############################.
krcd = 'KR6018001D68'
reportBvalue(krcd)



############################'
#' `씨지브이32CB(신종)`
#'  - 신용등급 A 상승 후 매도
#'  - 목표수익률 7% 수준(9500원)에서 매도
#'  - 올리브네트웍스 자회사 편입 후 매도
#'  + 개인투자자의 경우 2026.6.8일 이전에 매도하면 조건부이자 1,075원에 대한 세금 없음
#'  + 상환 하루 전일에 매도한다면 {11,074.56+25원(표면이자)}에서165원을 차감한 가격으로 매도
#'  - 24년 3월 발행 CJ CGV 39회(신종)에 비해 저평가
############################.
krcd = 'KR6079161B68'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가 = 9500)



# 씨제이 씨지브이32CB(신종)
#
# 채권정보
# CODE  KR6079161B68  |	발행TP      이표채  |	신용GD BBB+/BBB+
#     만기일  2051-06-08  |	Coupon        1.0%  |	옵션CD   CAL
# 상환일  2026-06-08  |	상환율      110.7%  |	투자GD  aaa
#
# 시세정보
# 기준일  2024-04-04  |	민평가       8,276  |	잔존기간   26 개월
# 매수일  2024-04-04  |	현재가       9,340  |	거래수량     51,435
# 상환일  2026-06-08  |	상환가      11,075  |	거래금액     48,074
#
# 수익분석
# 순현가       9,975  |	내부ROR       8.2%  |	총수익률     18.7%
#     할인율         6.8%  |	평균ROR       8.5%  |	월수익률      0.7%
#
# 투자분석
# 매입가       7,856  |	매입금액   601,347  |	보유수량   765,400
# 현재가       9,340  |	현수익금 113,585  |	현수익률    18.9%
# 상환가      11,075  |	상환수익   246,349  |	상환ROR      41.0%
#
# 현금흐름
# Date Year 세전CF 과세대상 원천세 거래비용 세후CF
# 1  2024-04-04  0.0 -9,340        0      0        5 -9,345
# 2  2024-06-08  0.2     25       18      3        0     22
# 3  2024-09-08  0.4     25       25      4        0     21
# 4  2024-12-08  0.7     25       25      4        0     21
# 5  2025-03-08  0.9     25       25      4        0     21
# 6  2025-06-08  1.2     25       25      4        0     21
# 7  2025-09-08  1.4     25       25      4        0     21
# 8  2025-12-08  1.7     25       25      4        0     21
# 9  2026-03-08  1.9     25       25      4        0     21
# 10 2026-06-08  2.2 11,100    1,100    169        5 10,925



############################'
#' `씨지브이35CB(신종)`
#'  - 신용등급 A 상승 후 매도
#'  - 목표수익률 7% 수준(9000원)에서 매도
#'  - CJ올리브네트웍스 현물출자 2분기 완료 예상
#'    (부채비율 386%, 리스부채 제외시 155% 수준)
############################.
krcd = 'KR6079161C75'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가 = 8420)
# reportBvalue(krcd, 매수가 = 9519)


############################'
#' `씨지브이36`
#'  - 월배당채권
#'  - 법인/연금 계좌에서 매수
#'  - 목표수익률 6% 수준에서 매수
############################.
krcd = 'KR6079161DC6'
reportBvalue(krcd)


############################'
## 씨제이 씨지브이39(신종)
############################.
krcd = 'KR6079162E31'
reportBvalue(krcd)


############################'
#' `핸즈코퍼레이션2`
#'   - 신용등급 'BB-' (부도확률 15%) - 나이스 23년 8월 상향
#'     모로코 공장 가동 정상화로 신용등급 상향 가능성
#'     기대수익 = (10000*0.30*0.85*1.0 - 10000*1.00*0.10)
#'   - 이노메트리 지분투자 100억
#'
############################.
krcd = 'KR6143211D60'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가=9750)


############################'
#' `에스지이17`
#'   - 신용등급 BB-  [20230623] (부도확률 10%)
#'     기대수익 = (10000*0.20*0.90 - 10000*1.00*0.10)
#'   - 친환경 아스콘 개발에 따른 매출 상승 확인 필요
#'   - 우크라이나 매출 확인
#'   - SG17WR 행사 가능
#'   - 리픽싱: ?원
#'
############################.
krcd = 'KR6255221D45'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가 = 10000)


############################'
#' `에이프로젠헬스케어앤게임즈6`
#'  - 신용등급 B- 그러나 부채비율 낮음
#'  - 수익률 10% 수준
#'  - CGV와 비교하면?? 수익률은 비슷, 신용등급은 낮음
############################.
krcd = 'KR6109961D71'
reportBvalue(krcd)
# reportBvalue(krcd, 매수가=9500)


############################'
##' `동아에스티8CB `
##'  - 풋옵션일: 2024.8.3 (신청기한: 2024.7.6)
##'  - 행사가격: 10,304.15원
##'  - 전환가 72,359원
##'  - 주의: 주가가 94,100원 이상이면 발행회사의 콜옵션
############################.
# krcd = 'KR6170901B86'
# reportBvalue(krcd)
# mybond %>% filter(BD_CD == krcd)



############################'
## 케이지모빌리티122
############################.
# krcd = 'KR6003622DC8'
# reportBvalue(krcd)
# reportBvalue(krcd, 매수가=8500)
# mybond %>% filter(BD_CD == krcd)


############################'
#' `에이치엘비생명과학9`
#'  - 신용등급 B (부도확률 20%)이나 부채비율 낮음
#'  - 시가총액 1조원 이상
#'  - 수익률 15% 수준
#'  - 단기 채권으로 투자
############################.
reportBvalue(krcd = 'KR6067631C64')


############################'
##' `이원다이애그노믹스10 `
##'   - 기관투자자 3자 배정 유상증자 80억(사채대용납입(7,8회)-보호예수1년)
##'   - 잔여채권 300억(7회 54억, 8회 40억, 10회 200억) --> 7,8회 조기상환 신청시 부도 --> 유상증자 80억 상실
##'   - 전환사채발행 200억
##'   + 공모채권은 상환 ????
##'   + 부도확률 하락 >> 점진적 투자
##'   + 10회 사채권자집회 가능한가??
############################.
reportBvalue(krcd = 'KR6245621D59')
# reportBvalue(krcd = 'KR6245621D59',  trd_dict = list(매수가 = 8088))


############################'
#' `태영건설68`
#'   - 워크아웃신청 2023-12-28
#'   - 워크아웃시 회생확률 50%
#'     기대수익 = (10000*0.20*0.5 - 10000*1.00*0.5)
############################.
krcd = 'KR6009411B71'
reportBvalue(krcd)


############################'
##' 한국유니온제약3
############################.
krcd = 'KR6080721D34'
reportBvalue(krcd, 매수가=9500)


############################'
#' 한국토지신탁44-2
############################.
# krcd = 'KR6034832E28'
# reportBvalue(krcd)


############################'
##' `삼척블루파워9`
##'  - 수익률 6% 수준에서 매입
############################.
# reportBvalue(krcd = 'KR6150351D99')
# reportBvalue(krcd = 'KR6150351D99',  매수가 = 10000)


############################'
## `롯데손해보험11(후)`
############################.
# reportBvalue(krcd = 'KR6000401D70')


############################'
## 이수앱지스8CB
############################.
reportBvalue(krcd = 'KR6086891DC9')


############################'
## 유니켐38
############################.
krcd = 'KR6011331D15'
reportBvalue(krcd)




##////////////////////////////////////////////////////End of Documents.
