################################################################### #.
#' CLASS : 주식관련사채 매매
#'
#'  funs : 1. 전환사채(CB)
#'         2. 신주인수권부증서(RT)
#'         3. 신주인수권부증권(WR)
#' 
#' 참 고 : 1. KRX    : browseURL('http://data.krx.co.kr')
#'         2. 나이스 : browseURL('https://www.nicerating.com')
#'         3. 한신평 : browseURL('https://www.kisrating.com')
#'         4. 한기평 : browseURL('https://www.korearatings.com')
#'         5. 장단기 : browseURL('https://fred.stlouisfed.org/series/T10Y2Y')
#'            금리차 : browseURL('https://fred.stlouisfed.org/series/T10Y3M')      
#'
#' + Url : browseURL('http://data.krx.co.kr')
#' + Path: dirname(rstudioapi::getSourceEditorContext()$path)
#' + KRX 20분 지연 데이터
#' 
################################################################### #.


############################'
## `0.작업환경`
############################.
if (!exists('home')) source(file.path(getwd(), 'func/0-global.R'))
if (!exists('TradeCB')) source(here('func', '4-trade-cb.R'))
if (!exists('TradeRT')) source(here('func', '4-trade-rt.R'))
if (!exists('TradeWR')) source(here('func', '4-trade-wr.R'))


############################'
## `보유자산` 
############################.


############################'
## `전환사채CB` 
############################.
inst.cnvt = TradeCB$new()
inst.cnvt$yield_cb() %>% select(-c(BD_CD, 세후소득))
inst.cnvt$trade_cb() %>% select(종목명, 신용등급, 추정수익률, 연추정수익률,
                          잔존월수, 매매가, 거래량, 전환가격, 주식가격, 패리티)


############################'
## `신주인수권(증서)`
############################.
inst.rght = TradeRT$new(bsdt = get_biz_date(prev = 0))
inst.rght$yield_rt() %>% select(-RT_CD)
# inst.rght$trade_rt('노을')
# inst.rght$trade_rt('노을', rt_prc = 1200, st_prc = 5000)



# -------------------------------------------------------------------------


############################'
## `신주인수권(증권)-인스턴스`
############################.
inst.wrnt = TradeWR$new()


############################'
## `신주인수권(증권)-현금납입`
(bw_cash = inst.wrnt$yield_cash(volt = 0.20)) %>% select(1,4,6:ncol(bw_cash)) %>% 
  select(-c(WR_CD, 손익단가))


############################'
## `신주인수권(증권)-사채대용납입`
(bw_bond = inst.wrnt$yield_bond(volt = 0.20)) %>% select(1,2,4:ncol(bw_bond))


############################'
## `신주인수권-채권-미매칭조회` 
# (match = inst.wrnt$match_code())


############################'
##' `에이프로젠 H&G 6WR`
##'  - 행사기한 : 2026-06-25
##'  - 행사가액 : 978원 (최저조정한도 = 893원)
##'               유상증자에 따른 행사가액 조정 예상
##'  - 2026년 1분기 수익발생 예상? (임상3상 완료는 2026년 4분기)
##'  - 목표주가 2000원 (50% 수익 예상)
##'
wcd = '1099621D'
dat = inst.wrnt$report(wrcd = wcd, WR_보유수량 = 163774, WR_매입단가 = 268, volt = 0.25)
# dat = inst.wrnt$report(wrcd = wcd, WR_보유수량 = 154000, WR_매입단가 = 276, ST_매도단가 = 1500)



############################'
##' `유니슨 15WR`
#'   - 신용등급 BB- (부도확률 10%)
#'     기대수익 = (10000*0.26*0.90*1.5 - 10000*1.00*0.10)
#'   - 투자시 연 26% 수익률 1.5년
#'   - 23년 5월 BB-로 하락 > 그 후 투자유치 4천억 > 신용등급 상승??
#'     밍양의 부품 공급망과 해상풍력 설치 인프라를 활용한 원가 경쟁력 확보
#'     2026년 설비 완료
#'  : 2023-07-13 ~ 2026-05-13
#'  : 행사비율 100%
#'  - 최저조정한도 = 1,119원 (1,598원의 70% 이상)
#'  
#'  신주인수권 행사현황: 2023-09-10
#'   - 발행주식총수 = 122,248,023
#'   - 권면총액 = 30,000,000,000좌
#'   - 행사가액 = 1,598원
#'   - 행사주식수누계 =  1,255,659
#'   - 행사가능주식수 = 15,057,272
#'   - 행사가능주식비율 = 행사가능주식수 / 발행주식총수 *100
#'  
# 행사가액 조정일
# 2024년 03월 13일, 2024년 06월 13일,
# 2024년 09월 13일, 2024년 12월 13일, 2025년 03월 13일, 2025년 06월 13일,
# 2025년 09월 13일, 2025년 12월 13일, 2026년 03월 13일.
wcd = '0180021D'
dat = inst.wrnt$report(wcd, volt = 0.25, WR_매입단가 = 211, WR_보유수량 = 121000)
# dat = inst.wrnt$report(wcd, WR_매입단가 = 211, WR_보유수량 = 121000)
# bw_bond %>% filter(WR_CD == wcd)


# 목표주가 2,500원
# dat = inst.wrnt$report(wcd, WR_매입단가 = 211, WR_보유수량 = 120000, ST_매도단가 = 2500)


############################'
##' `SG 17WR`
#'   - 행사기한 : 2026-03-06
#'   - 부도위험 : 신용등급 B+ (부도확률 20%)
#'   - 사업환경 :
#'      . 친환경 아스콘 개발에 따른 매출 상승 확인 필요
#'      . 우크라이나 수출 매출 확인
#'   - 리픽싱 : ?원
#'   - 목표가 : 3,000원
#'     
############################.
wcd = '2552221D'
dat = inst.wrnt$report(wrcd = wcd, WR_보유수량 = 20000, WR_매입단가 = 447, volt = 0.25)
# dat = inst.wrnt$report(wrcd = wcd, WR_보유수량 = 25500, WR_매입단가 = 447, ST_매도단가 = 4500)
# bw_bond %>% filter(WR_CD == wcd)


############################'
##' `핸즈코퍼레이션 2WR `
#'   - 행사기한 : 2026-05-15
#'   - 부도위험 : 신용등급 B+ (부도확률 20%)
#'   - 사업환경 :
#'      . 매출 정상화 진행 중
#'      . 
#'   - 리픽싱 : 2,651원
#'   - 목표가 : 4,000원
#'  - 
#'     
############################.
wrcd = '1432121D'
dat = inst.wrnt$report(wrcd = wrcd, WR_보유수량 = 7324, WR_매입단가 = 534, volt = 0.25)
# dat = inst.wrnt$report(wrcd = wrcd, WR_보유수량 = 7324, WR_매입단가 = 534, ST_매도단가 = 4000)


############################'
##' `이원다이애그노믹스10WR`
#'   - 행사기한 : 2026-05-15
#'   - 부도위험 : 신용등급 B+ (부도확률 20%)
#'   - 사업환경 :
#'      . 3자배정 유상증자(사모펀드) 9%보유
#'      . 납입은 전환사채7,8회로 하였고 1년 보호예수
#'      . 경영권 이전을 포함한 3자배정 유상증자 진행 중
#'   - 리픽싱 : ?원
#'   - 목표가 : 4,000원
#'  - 
#'     
############################.
wrcd = '2456221D'
stcd = '245620'
bdcd = 'KR6245621D59'
dat = inst.wrnt$report(wrcd = wrcd, WR_보유수량 = 10, WR_매입단가 = 54, volt = 0.25)


##////////////////////////////////////////////////////End of Documents.
